app/controllers/articles_controller.rb

	def show
		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]

	def index
		@articles = Article.all
---
SELECT "articles".* FROM "articles"

	def create
		@article = Article.new(article_params)

		if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first test"], ["text", "test"], ["created_at", "2015-08-12 20:45:21.852473"], ["updated_at", "2015-08-12 20:45:21.852473"]]

	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "article#show5"], ["updated_at", "2015-08-13 14:13:12.219029"], ["id", 5]]

	def destroy
		@article = Article.find(params[:id])
		@article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]