app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["article_id", 1], ["created_at", "2015-08-13 15:20:07.335421"], ["updated_at", "2015-08-13 15:20:07.335421"]]